package by.epam.student.dobrov.mod2.DecArr7;

/*
Написать метод(методы) для вычисления суммы факториалов всех нечетных чисел от 1 до 9.
 */
public class DecArr7 {
    public static void main(String[] args) {

        int sum = MathDecision.findSumFactorialOddNumbers();

        System.out.println("Cумма  факториалов всех нечетных  чисел = " + sum);
    }
}
